## Plan Result (test-cftapps_cluster_lb)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.cftapps-frontend-cluster-lb.azurerm_application_gateway.ag[0]
  * module.cftapps-frontend-cluster-lb.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cftapps-frontend-cluster-lb.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.cftapps-frontend-cluster-lb.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw"
        name                = "aks-fe-00-perftest-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/sscs-tribunals"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "sscs-tribunals"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/sscs-cor"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "sscs-cor"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/civil-citizen-ui"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "civil-citizen-ui"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/cmc"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "cmc"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/cmc-legal"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "cmc-legal"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/gateway-ccd"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "gateway-ccd"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/return-case-doc-ccd"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "return-case-doc-ccd"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/fact"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "fact"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/fact-admin"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "fact-admin"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/nfdiv"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "nfdiv"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/nfdiv-apply"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "nfdiv-apply"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/nfdiv-civil"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "nfdiv-civil"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/idam-web-public"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "idam-web-public"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/probate"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "probate"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/pcq"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "pcq"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/lau"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "lau"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/paybubble"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "paybubble"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/bar"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "bar"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/fees-register"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "fees-register"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/xui-approve-org"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "xui-approve-org"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/xui-manage-org"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "xui-manage-org"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/xui-register-org"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "xui-register-org"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/ia-aip"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "ia-aip"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/xui-webapp"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "xui-webapp"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/idam-web-admin"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "idam-web-admin"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/hmi-apim"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "hmi-apim"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/reformscan"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "reformscan"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/idam-user-dashboard"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "idam-user-dashboard"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/div-dn"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "div-dn"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/div-da"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "div-da"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/div-rfe"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "div-rfe"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/div-pfe"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "div-pfe"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/cft-api-mgmt"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "cft-api-mgmt"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/adoption-web"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "adoption-web"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/privatelaw"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "privatelaw"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/paymentoutcome-web"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "paymentoutcome-web"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/plum"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "plum"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw/backendAddressPools/et-sya"
          ~ ip_addresses = [
                "10.48.79.250",
              - "10.48.95.250",
            ]
            name         = "et-sya"
            # (1 unchanged attribute hidden)
        }










        # (160 unchanged blocks hidden)
    }

  # module.cftapps-frontend-cluster-lb.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1224,"Program":"tfcmt","SHA1":"","Target":"test-cftapps_cluster_lb","Vars":{}} -->